function showPopup(service) {
  const popupTitle = document.getElementById("popup-title");
  const docList = document.getElementById("doc-list");
  const extraInfo = document.getElementById("extra-info");

  if (service === "A") {
    popupTitle.textContent = "આધાર કાર્ડ માં સરનામું બદલવા માટે";
    docList.innerHTML = `
      <li>ચુંટણીકાર્ડ</li>
      <li>ગેજેટ ઓફોસ</li>
      <li>રેશન કાર્ડ</li>
      <li>લાઈટ બીલ</li>
      <li>મેરેજ સર્ટીફીકેટ</li>
      <li>ગેસ બીલ</li>
      <li>બેંક પાસબૂક</li>
      <li>ST/SC/OBC સર્ટીફીકેટ</li>
      <li>ઇન્ડિયન પાસપોટ</li>
      <li>રહેવાસી નો દાખલો</li>
    `;
    extraInfo.textContent = "આભાર";
  } else if (service === "B") {
    popupTitle.textContent = "નવા ચુંટણીકાર્ડ માટે";
    docList.innerHTML = `
      <li>પાસપોર્ટ સાઈઝ નો તાજેતર નો ફોટો.</li>
      <li>સ્કૂલ છોડયા નું પ્રમાણપત્ર અથવા જન્મ દાખલો.</li>
      <li>આધાર કાર્ડ તથા રેશનકાર્ડ નકલ</li>
      <li>મેરેજ સર્ટી અથવા કંકોત્રી નકલ</li>
    `;
    extraInfo.textContent = "દરેક દસ્તાજેજ ની 1 ક્ષેરોક્ષ સાથે લાવી. આભાર";
  }else if (service === "C") {
    popupTitle.textContent = "ચુંટણીકાર્ડ મા સરનામું બદલવા માટે";
    docList.innerHTML = `
      <li>પાસપોર્ટ સાઈઝ નો તાજેતર નો ફોટો.</li>
      <li>ચુંટણીકાર્ડ</li>
      <li>લાઈટબીલ / રેશનકાર્ડ / ગેસ બીલ અથવા ઘરવેરા પાવતીની નકલ</li>
    `;
    extraInfo.textContent = "દરેક દસ્તાજેજ ની 1 ક્ષેરોક્ષ સાથે લાવી. આભાર";
  }else if (service === "D") {
    popupTitle.textContent = "ચુંટણીકાર્ડ મા નામ / અટક / જન્મતારીખ / સબંધ / ફોટો સુધારવા માટે";
    docList.innerHTML = `
      <li>ચુંટણીકાર્ડ</li>
      <li>પાસપોર્ટ સાઈઝ નો તાજેતર નો ફોટો.</li>
      <li>સ્કૂલ છોડયા નું પ્રમાણપત્ર અથવા જન્મ દાખલો. ( નામ / અટક / અથવા જન્મ તારીખ સુધારવા માટે)</li>
      <li>લાઈટબીલ / રેશનકાર્ડ / ગેસ બીલ અથવા ઘરવેરા પાવતીની નકલ ( સરનામું સુધારવા માટે)</li>
    `;
    extraInfo.textContent = "દરેક દસ્તાજેજ ની 1 ક્ષેરોક્ષ સાથે લાવી. આભાર";
  }else if (service === "E") {
    popupTitle.textContent = "ચુંટણીકાર્ડ મા પતિ નુ નામ ચડાવા માટે";
    docList.innerHTML = `
      <li>પત્ની નો પાસપોર્ટ સાઈઝ નો તાજેતર નો ફોટો.</li>
      <li>પત્ની નુ સ્કૂલ છોડયા નું પ્રમાણપત્ર અથવા જન્મ દાખલો.</li>
      <li>પતિ અને પત્ની નુ આધાર કાર્ડ </li>
      <li>પતિ નુ રેશનકાર્ડ નકલ</li>
      <li>મેરેજ સર્ટી અથવા કંકોત્રી નકલ</li>
    `;
    extraInfo.textContent = "દરેક દસ્તાજેજ ની 1 ક્ષેરોક્ષ સાથે લાવી. આભાર";
  }else if (service === "F") {
    popupTitle.textContent = "વહલી દીકરી યોજના";
    docList.innerHTML = `
      <li>દીકરી પાસપોર્ટ સાઈઝ ફોટો.</li>
      <li>દીકરી આધાર કાર્ડ.</li>
      <li>દીકરી જન્મ દાખલો</li>
      <li>દીકરી બેંક પાસબૂક</li>
      <li>માતા પિતા નુ આધાર કાર્ડ</li>
      <li> આવક નો દાખલો</li>
      <li>માતા પિતા લગ્ન નુ પ્રમાણ પત્ર</li>
      <li>રેસન કાર્ડ</li>
      <li>માતા પિતા નો જન્મ નો દાખલો</li>
      <li>માતા પિતા નં સ્કુલ છોડયાનું પ્રમાણપત્ર</li>
      <li>માતા પિતાનું પાન કાર્ડ અને ચુંટણી કાર્ડ</li>
    `;
    extraInfo.textContent = "દરેક દસ્તાજેજ ની 1 ક્ષેરોક્ષ સાથે લાવી. આભાર";
  }else if (service === "G") {
    popupTitle.textContent = "નવું પાનકાર્ડ બનાવવા માટે";
    docList.innerHTML = `
      <li>પાસપોર્ટ સાઈઝ ફોટો 2 નંગ.</li>
      <li>આધાર કાર્ડ.</li>
      <li>પિતા/પતિ નુ આધાર કાર્ડ.</li>
      <li>સફેદ કાગળ પર સહી</li>
    `;
    extraInfo.textContent = "દરેક દસ્તાજેજ ની 1 ક્ષેરોક્ષ સાથે લાવી. આભાર";
  }else if (service === "H") {
    popupTitle.textContent = "લાઈટ બીલ માં નામ બદલવા માટે ( વારસાઈ )";
    docList.innerHTML = `
      <li>એગ્રીમેન્ટ સ્ટેમ્પ (વકીલ દ્વારા બનાવેલ).</li>
      <li>લાઈટ બીલ.</li>
      <li>ઘરની આકારણી.</li>
      <li>પિતા નો મરણ નો દાખલો.</li>
    `;
    extraInfo.textContent = "દરેક દસ્તાજેજ ની 1 ક્ષેરોક્ષ સાથે લાવી. આભાર";
  }else if (service === "I") {
    popupTitle.textContent = "ખેડૂત 2000 સહાય ફોર્મ ભરવા માટે";
    docList.innerHTML = `
      <li>પાસપોર્ટ સાઈઝ ફોટો.</li>
      <li>આધાર કાર્ડ.</li>
      <li>પિતા/પતિ/પત્ની નુ આધાર કાર્ડ.</li>
      <li>મરણ નો દાખલો</li>
      <li>બેંક પાસબૂક</li>
      <li>૮અ નકલ</li>
      <li>7/12 નકલ</li>
      <li>6 હક પત્રક</li>
    `;
    extraInfo.textContent = "દરેક દસ્તાજેજ ની 1 ક્ષેરોક્ષ સાથે લાવી. આભાર";
  }else if (service === "J") {
    popupTitle.textContent = "કુંવરબાઈ નું મામેરું સહાય ફોર્મ ભરવા માટે";
    docList.innerHTML = `
      <li>છોકરી પાસપોર્ટ સાઈઝ ફોટો.</li>
      <li>આધાર કાર્ડ.</li>
      <li>પિતા નુ આધાર કાર્ડ.</li>
      <li>પતિ નુ આધાર કાર્ડ.</li>
      <li>બેંક પાસબૂક</li>
      <li>લગ્ન નુ પ્રમાણ પત્ર</li>
      <li>રેસન કાર્ડ</li>
      <li>આવકનો દાખલો પિતા નો</li>
    `;
    extraInfo.textContent = "દરેક દસ્તાજેજ ની 1 ક્ષેરોક્ષ સાથે લાવી. આભાર";
  }else if (service === "K") {
    popupTitle.textContent = "આર.ટી.ઈ નુ ફોર્મ ભરવા માટે";
    docList.innerHTML = `
      <li>પાસપોર્ટ સાઈઝ કલર ફોટોગ્રાફ.</li>
      <li>બાળકનું આધારકાર્ડ</li>
      <li>વાલીનું આધારકાર્ડ</li>
      <li>બેંકની વિગતો [ બાળક કે વાલીના બેંક ખાતાની પાસબુક ].</li>
      <li>ચુંટણીકાર્ડ,પાનકાર્ડ,લાઈટ બીલ,રેશન કાર્ડ.</li>
      <li>વાલીનું જાતીનું પ્રમાણપત્ર [ લાગુ પડે તો ].</li>
      <li>જન્મનું પ્રમાણપત્ર. [ બાળક નુ ] </li>
      <li>વાલીની આવકનું પ્રમાણપત્ર.</li>
      <li>બીપીએલ [ ૦ થી ૨૦ આંક સુધીની ].</li>
      <li>વિચરતી જાતિઓ અને વિમુકત જનજાતિઓ [ લાગુ પડે તો ].</li>
      <li>અનાથ બાળક [ જે તે જીલ્લાની ચાઈલ્ડ વેલ્ફેર કમિટી (CWC) નું પ્રમાણપત્ર ].</li>
      <li>સંભાળ અને સંરક્ષણની જરૂરિયાતવાળું બાળક [ CWC નું પ્રમાણપત્ર ].</li>
      <li>બાલગૃહના બાળકો [ CWC નું પ્રમાણપત્ર ].</li>
      <li>બાળમજૂર / સ્થળાંતરીત મજુરના બાળકો [ જે તે જીલ્લાના લેબર અને રોજગાર વિભાગનું શ્રમ અધિકારીનું પ્રમાણપત્ર ].</li>
      <li>સેરેબ્રલી પાલ્સી વાળા બાળકો [ સિવિલ સર્જન પ્રમાણપત્ર ].</li>
      <li>ખાસ જરૂરિયાતવાળા બાળકો (દિવ્યાંગ) [ સિવિલ સર્જનનું પ્રમાણપત્ર (લઘુતમ 40%) ].</li>
      <li>(ART) એન્ટિ-રેટ્રોવાયરલ થેરેપીની સારવાર લેતા બાળકો [ સિવિલ સર્જન પ્રમાણપત્ર ].</li>
      <li>શહીદ થયેલ જવાનના બાળકો [ સંબંધિત ખાતાના સક્ષમ અધિકારીનો દાખલો ].</li>
      <li>સંતાનમાં એક માત્ર દીકરી હોય તે કેટેગરી માટે [ ગ્રામ્ય વિસ્તાર માટે તલાટી કમ મંત્રીશ્રી, નગરપાલિકા વિસ્તાર માટે ચીફ ઓફિસર અને મહાનગરપાલિકા વિસ્તાર માટે
સક્ષમ અધિકારીનો એક માત્ર દીકરી જ સંતાન (સિંગલ ગર્લ ચાઈલ્ડ) હોવાનો દાખલો ].</li>
      <li>સરકારી આંગણવાડીમાં અભ્યાસ કરતાં બાળકો [ સરકારી આંગણવાડીમાં ઓછામાં ઓછા 2 વર્ષ અભ્યાસ કરેલ હોય અને ICDS-CAS વેબપોર્ટલ પર જે
વિદ્યાર્થીઓના નામ નોંધાયેલ હોય તેવા વિદ્યાર્થીઓએ જે તે આંગણવાડીમાં અભ્યાસ કરેલ છે તે મતલબનું
સબંધિત આંગણવાડીનાં આંગણવાડી વર્કર અથવા સરકારશ્રી દ્વારા પ્રમાણિત કરેલ દાખલો રજુ કરવો. ]</li>
      
    `;
    extraInfo.textContent = "દરેક દસ્તાજેજ ની 1 ક્ષેરોક્ષ સાથે લાવી. આભાર";
  }else if (service === "L") {
    popupTitle.textContent = "પાન કાર્ડ માં સુધારા માટે";
    docList.innerHTML = `
      <li>પાસપોર્ટ સાઈઝ કલર ફોટોગ્રાફ.</li>
      <li>આધાર કાર્ડ.</li>
      <li>પાન કાર્ડ.</li>
      <li>પતિ અથવા પિતાનું આધાર કાર્ડ.</li>
      <li>સફેદ કાગળ પર સહી.</li>
    `;
    extraInfo.textContent = "દરેક દસ્તાજેજ ની 1 ક્ષેરોક્ષ સાથે લાવી. આભાર";
  }else if (service === "M") {
    popupTitle.textContent = "રેશનકાર્ડ માં નામ ઉમેરવા માટે";
    docList.innerHTML = `
      <li>પાસપોર્ટ સાઈઝ કલર ફોટોગ્રાફ.</li>
      <li>રેશનકાર્ડ.</li>
      <li>જે પણ વ્યક્તિ ના નામ ઉમેરવાના હોય તે વ્યક્તિ ના આધાર કાર્ડ.</li>

    `;
    extraInfo.textContent = "દરેક દસ્તાજેજ ની 1 ક્ષેરોક્ષ સાથે લાવી. આભાર";
  }else if (service === "N") {
    popupTitle.textContent = "રેશનકાર્ડ માં નામ કમી કરવા માટે";
    docList.innerHTML = `
      <li>પાસપોર્ટ સાઈઝ કલર ફોટોગ્રાફ.</li>
      <li>રેશનકાર્ડ.</li>
      <li>જે પણ વ્યક્તિ ના નામ કમી કરવા ના હોય તે વ્યક્તિ ના આધાર કાર્ડ.</li>
      
    `;
    extraInfo.textContent = "દરેક દસ્તાજેજ ની 1 ક્ષેરોક્ષ સાથે લાવી. આભાર";
  }else if (service === "O") {
    popupTitle.textContent = "રેશનકાર્ડ અલગ કરવા માટે";
    docList.innerHTML = `
      <li>પાસપોર્ટ સાઈઝ કલર ફોટોગ્રાફ.</li>
      
    `;
    extraInfo.textContent = "દરેક દસ્તાજેજ ની 1 ક્ષેરોક્ષ સાથે લાવી. આભાર";
  }else if (service === "P") {
    popupTitle.textContent = "રેશનકાર્ડ નવું કાઠવા માટે";
    docList.innerHTML = `
      <li>પાસપોર્ટ સાઈઝ કલર ફોટોગ્રાફ.</li>
      
    `;
    extraInfo.textContent = "દરેક દસ્તાજેજ ની 1 ક્ષેરોક્ષ સાથે લાવી. આભાર";
  }else if (service === "Q") {
    popupTitle.textContent = "જન્મ ના દાખલા માટે";
    docList.innerHTML = `
      <li>જુનો જન્મ નો દાખલો.</li>
      <li>પિતા અને માતા નુ આધાર કાર્ડ.</li>
      
    `;
    extraInfo.textContent = "દરેક દસ્તાજેજ ની 1 ક્ષેરોક્ષ સાથે લાવી. આભાર";
  }else if (service === "R") {
    popupTitle.textContent = "ખેડૂત નોધણી માટે";
    docList.innerHTML = `
      <li>આધાર કાર્ડ.</li>
      <li>7/12 અને 8 અ ની નકલ.</li>
      
    `;
    extraInfo.textContent = "દરેક દસ્તાજેજ ની 1 ક્ષેરોક્ષ સાથે લાવી. આભાર";
  }else if (service === "S") {
    popupTitle.textContent = "નવું પાસપોર્ટ માટે";
    docList.innerHTML = `
      <li>પાસપોર્ટ સાઈઝ કલર ફોટોગ્રાફ.</li>
      
    `;
    extraInfo.textContent = "દરેક દસ્તાજેજ ની 1 ક્ષેરોક્ષ સાથે લાવી. આભાર";
  }else if (service === "T") {
    popupTitle.textContent = "પાસપોર્ટ રી-ન્યુ કરવા માટે";
    docList.innerHTML = `
      <li>પાસપોર્ટ સાઈઝ કલર ફોટોગ્રાફ.</li>
      <li>આધાર કાર્ડ.</li>
      <li>જુનો પાસપોર્ટ.</li>
      <li>જન્મ નો દાખલો.</li>
      
    `;
    extraInfo.textContent = "દરેક દસ્તાજેજ ની 1 ક્ષેરોક્ષ સાથે લાવી. આભાર";
  }

  document.getElementById("popup").style.display = "flex";
}

function closePopup() {
  document.getElementById("popup").style.display = "none";
}
